main/src/Documents/РасходДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Document>
		<Properties>
			<Name>РасходДенежныхСредств</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПланируемыеОстаткиДенежныхСредств</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредства</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРасхода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

main/src/Enums/ВидыРасходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>ВидыРасходов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Планируемый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Фактический</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

main/src/Documents/РасходДенежныхСредств/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ОтборПоДате") И Параметры.ОтборПоДате Тогда
		ДатаНачалаПериода = ОбщегоНазначенияКлиентСервер.ПолучитьДатуНачалаПериода(ТекущаяДата());
		ДатаОкончанияПериода = ОбщегоНазначенияКлиентСервер.ПолучитьДатуОкончанияПериода(ТекущаяДата()); 
		УстановитьОтборПоДате(Истина);
	КонецЕсли;
	
	Если Параметры.Отбор.Свойство("ВидРасхода") Тогда
		Если Параметры.Отбор.ВидРасхода = Перечисления.ВидыРасходов.Планируемый Тогда
			Заголовок = "Планируемые расходы";
		ИначеЕсли Параметры.Отбор.ВидРасхода = Перечисления.ВидыРасходов.Фактический Тогда
			Заголовок = "Фактические расходы";	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СдвинутьПериодНазад(Команда)
	
	ДатаОкончанияПериода = ДатаНачалаПериода - 1;
	ДатаНачалаПериода = ОбщегоНазначенияКлиентСервер.ПолучитьДатуНачалаПериода(ДатаОкончанияПериода);
	УстановитьОтборПоДате(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СдвинутьПериодВперед(Команда)
	
	ДатаНачалаПериода = ДатаОкончанияПериода + 1;
	ДатаОкончанияПериода = ОбщегоНазначенияКлиентСервер.ПолучитьДатуОкончанияПериода(ДатаНачалаПериода);
	УстановитьОтборПоДате(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВесьСписок(Команда)
	
	Элементы.ПоказатьВесьСписок.Пометка = Не Элементы.ПоказатьВесьСписок.Пометка;
	
	УстановитьОтборПоДате(Не Элементы.ПоказатьВесьСписок.Пометка);
	
	Если Элементы.ПоказатьВесьСписок.Пометка Тогда
		Элементы.ПоказатьВесьСписок.Заголовок = "Включить отбор по периоду";
	Иначе
		Элементы.ПоказатьВесьСписок.Заголовок = "Показать весь список";
	КонецЕсли;
	
	Элементы.ОтборПериод.Видимость = Не Элементы.ПоказатьВесьСписок.Пометка;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаСервере
Процедура УстановитьОтборПоДате(Использовать)
	
	Список.КомпоновщикНастроек.Настройки.Отбор.Элементы.Очистить();
	
	ШаблонПредставлениеПериода = "%1 - %2";
	ПредставлениеПериода = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		ШаблонПредставлениеПериода,
		Формат(ДатаНачалаПериода, "ДЛФ=DD"),
		Формат(ДатаОкончанияПериода, "ДЛФ=DD"));
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
		Список.КомпоновщикНастроек.Настройки.Отбор,
		"Дата",
		ВидСравненияКомпоновкиДанных.БольшеИлиРавно,
		ДатаНачалаПериода,
		,
		Использовать);
		
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
		Список.КомпоновщикНастроек.Настройки.Отбор,
		"Дата",
		ВидСравненияКомпоновкиДанных.МеньшеИлиРавно,
		ДатаОкончанияПериода,
		,
		Использовать);
		
КонецПроцедуры

#КонецОбласти
